app/views/shared/_navbar.html.erb

          <li class="nav-item">
            <%= link_to "Messages", chatroom_path(Chatroom.all.first), class: "nav-link" %>
---
SELECT "chatrooms".* FROM "chatrooms" ORDER BY "chatrooms"."id" ASC LIMIT $1  [["LIMIT", 1]]