app/controllers/chatrooms_controller.rb

SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @chatroom = Chatroom.find(params[:id])